# Напиши програм који исписује све линије које се учитају са стандардног улаза у обратном редоследу од
# редоследа учитавања.
#
# Улаз: Са стандардног улаза се учитавају линије текста, све до краја улаза.
#
# Излаз: На стандардни излаз исписати учитане линије у обратном редоследу.
#
# Пример
# Улаз
# zdravo
# svete
# dobar
# dan
#
# Излаз
# dan
# dobar
# svete
# zdravo

lista = []

while(True):
    x = input()
    if x == "":
        break
    lista.append(x)

for i in range(len(lista)-1,-1,-1):
    print(lista[i])
