# Дате су температуре у неколико градова. Написати програм којим се одређује, колика је температура у најхладнијем граду.
#
# Улаз: Прва линија стандардног улаза садржи природан број n (3 ≤ n ≤ 50) који представља број градова,
# а у свакој од наредних n линија налази се цео број t (−20 ≤ t ≤ 40) који представља температуру у
# одговарајућем граду.
#
# Излаз: На стандардном излазу, у једној линији, приказати температуру у најхладнијем граду.
#
# Пример
# Улаз
# 5
# 10
# -12
# 22
# -13
# 15
# Излаз
# -13

def ucitaj_niz():
    n = int(input("Unesi broj gradova cije temeprature ispitujemo: ")) 
    a = [int(input()) for i in range(n)]
    return (a, n)

def minimum(a, n):
    min_t = a[0]
    for i in range(1, n):
        if a[i] < min_t:
            min_t = a[i]
    return min_t

(a, n) = ucitaj_niz()

print("Najniza temperatura je: ",minimum(a, n))
