# Дате су дневне температуре редом за сваки дан једне седмице.
# Написати програм којим се одређује редни број најтоплијег дана те седмице (ако их има више исписати први).
# Дани у седмици су нумерисани бројевима од 1 до 7, почев од понедељка.
#
# Улаз: Са стандардног улаза уноси се 7 целих бројева из интервала [−50, 50]. Сваки број је у посебном реду.
# Бројеви редом представљају температуре измерене у понедељак, уторак, среду, четвртак, петак, суботу и недељу.
#
# Излаз: На стандардном излазу исписати тражени редни број најтоплијег дана.
#
# Пример
# Улаз
# 27
# 32
# 28
# 27
# 32
# 31
# 29
# Излаз
# 2

# niz temperatura
t = [int(input("Uneti maksimalnu dnevnu temperaturu: ")) for i in range(7)]

rbrNajtoplijegDana = t.index(max(t)) + 1

print(rbrNajtoplijegDana)
