# Посматрајмо скуп природних бројева 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, …
# Прво избришемо сваки други број и посматрани скуп постаје 1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, … затим из
# добијеног скупа бришемо сваки трећи број и добијамо скуп 1, 3, 7, 9, 13, 15, 19, 21, … затим из добијеног
# скупа бришемо сваки четврти број и тако даље. Скуп необрисаних бројева је 1, 3, 7, 13, 19, … Написати
# програм којим се за дати природан број n проверава да ли припада скупу необрисаних бројева.
#
# Улаз: Прва линија стандарног улаза садржи природан број n (n < 5 · 10^5 ).
#
# Излаз: Реч da ако број n припада скупу необрисаних бројева, у супротном реч ne.
#
# Пример 1
# Улаз
# 39
# Излаз
# da
# Пример 2
# Улаз
# 41
# Излаз
# ne

n = int(input("Unesi broj n radi provere da li pripada skupu neobrisanih brojeva: "))
k = 1
a = []

for i in range(1, 1001):
    a.append(i)

while k < len(a):
    for i in range(k, len(a) // 2, k):
        del a[i]
    k = k + 1

if n in a:
    print("da")
else:
    print("ne")
