# Поштар иде улицом и треба да распореди пошиљке. Одлучио је да прво обиђе једну страну улице (на којој су
# куће са парним бројевима), а да у повратку обиђе другу страну улице (на којој су куће са непарним бројевима).
# Напиши програм који за унете бројеве кућа одређује које су на парној, а које на непарној страни улице.
#
# Улаз: Са стандардног улаза се уноси број пошиљки (природан број k мањи од 100), а затим и k природних
# бројева који представљају бројеве кућа на пошиљкама. Сваки број је задат у посебном реду.
#
# Излаз: На стандардни излаз исписати два реда бројева. У првом реду се налазе сви парни бројеви (исписани
# у истом редоследу у којем су унети), а у другом сви непарни бројеви (исписани у истом редоследу у којем су
# унети). Бројеви у сваком реду треба да су раздвојени по једним размаком, а размак може бити наведен и иза
# последњег броја.
#
# Пример
# Улаз
# 5
# 1
# 2
# 3
# 4
# 5
# Излаз
# 2 4
# 1 3 5

def ucitaj_niz():
    n = int(input("Unesi broj posiljka koje se isporucuju: "))
    a = [int(input("Unesi broj kuce gde nosis postu: ")) for i in range(n)]
    return a

def izdvoj_parne(a):
    parni = []
    for x in a:
        if x % 2 == 0:
            parni.append(x)
    return parni

def izdvoj_neparne(a):
    neparni = []
    for x in a:
        if x % 2 != 0:
            neparni.append(x)
    return neparni

def ispisi_niz(a):
    for x in a:
        print(x, end=" ")
    print()

a = ucitaj_niz()

parni = izdvoj_parne(a)
neparni = izdvoj_neparne(a)

ispisi_niz(parni)
ispisi_niz(neparni)
