# Поштар иде улицом и треба да распореди пошиљке. Одлучио је да прво обиђе једну страну улице (на којој су
# куће са парним бројевима), а да у повратку обиђе другу страну улице (на којој су куће са непарним бројевима).
# Напиши програм који за унете бројеве кућа одређује које су на парној, а које на непарној страни улице.
#
# Улаз: Са стандардног улаза се уноси број пошиљки (природан број k мањи од 100), а затим и k природних
# бројева који представљају бројеве кућа на пошиљкама. Сваки број је задат у посебном реду.
#
# Излаз: На стандардни излаз исписати два реда бројева. У првом реду се налазе сви парни бројеви (исписани
# у истом редоследу у којем су унети), а у другом сви непарни бројеви (исписани у истом редоследу у којем су
# унети). Бројеви у сваком реду треба да су раздвојени по једним размаком, а размак може бити наведен и иза
# последњег броја.
#
# Пример
# Улаз
# 5
# 1
# 2
# 3
# 4
# 5
# Излаз
# 2 4
# 1 3 5

parni = []
neparni = []

k = int(input("Unesi broj posiljka koje se isporucuju: "))

for i in range(k):
    x = int(input("Unesi broj kuce gde nosis postu: "))

    if x % 2 == 0:          # ako je paran
        parni.append(x)     # smestamo ga u niz parnih
    else:                   # u suprotnom
        neparni.append(x)   # smestamo ga u niz neparnih

for p in parni:
    print(p, end=" ")

print()

for n in neparni:
    print(n, end=" ")
