# Са стандардног улаза се учитава број поена такмичара на такмичењу из програмирања. Напиши програм
# који израчунава просечан број поена свих такмичара.
#
# Улаз: Сваки ред стандардног улаза садржи један цео број између 0 и 100.
# НАПОМЕНА: приликом интерактивног тестирања програма,
# крај стандардног улаза се означава комбинацијом тастера ctrl + z ако се
# користи оперативни систем Windows тј. ctrl + d aко се користи оперативни систем Linux.
#
# Излаз: На стандардни излаз исписати просек заокружен на 5 децимала.
#
# Пример
# Улаз
# 1
# 2
# 3
# 4
# Излаз
# 2.50000

import sys

a = [int(linija) for linija in sys.stdin]

prosek = sum(a) / len(a)
print(format(prosek, '.5f'))
