# Током неколико дана маратонац се спрема за предстојећу трку. За сваки дан познато је растојање које је
# тог дана претрчао. Одредити да ли је тркач правио напредак тј. да ли су учитани бројеви уређени у строго
# растућем редоследу.
#
# Улаз: Прва линија стандардног улаза садржи природан број N (1 ≤ N ≤ 50) који представља број дана, а
# у свакој од наредних N линија налази се по један природан број који представља број метара који је тркач
# претрчао одговарајућег дана.
#
# Излаз: На стандардном излазу исписати одговор Da ако су бројеви у строго растућем поретку и одговор Ne
# у супротном.
#
# Пример 1
# Улаз
# 4
# 19
# 20
# 22
# 23
# Излаз
# Da
# Пример 2
# Улаз
# 4
# 20
# 20
# 23
# 23
# Излаз
# Ne

n = int(input("Unesi broj dana koje je trkac trcao: "))
a = [int(input("Unesi broj predjenih metara za tekuci dan:  ")) for i in range(n)]

tekuci = a[0]
monotonost = True

for i in range(1, len(a)):
    if tekuci >= a[i]:
        monotonost = False
        break

print("Da" if monotonost else "Ne")
