# Написати програм који учитани низ целих бројева трансформише тако да се свака вредност појављује тачно
# једном у низу, при чему се чува редослед елемената (редослед њиховог првог појављивања).
#
# Улаз: У једној линији стандардног улаза налази се број елемената низа N (0 < N ≤ 10000), а затим се, у
# свакој од N наредних линија стандардног улаза, налази по један члан низа.
#
# Излаз: У свакој линији стандардног излаза исписује се по један елемент трансформисаног низа.
#
# Пример
# Улаз
# 6
# 1
# 3
# 1
# 2
# 3
# 2
# Излаз
# 1
# 3
# 2

# u listu a ćemo upisivati one elemente koji već nisu u njoj
a = []

# učitavamo n elemenata
n = int(input("Unesi broj elemenata niza: "))

for i in range(n):
    x = int(input("Unwesi element: "))
    if not (x in a):
        a.append(x)

# ispisujemo elemente liste a
for x in a:
    print(x)
