# Уноси се масе предмета, одредити разлику суме маса предмета до првог појављивања предмета највеће масе
# и суме маса предмета после првог појављивања предмета највеће масе (предмет највеће масе није укуључен
# ни у једну суму).
#
# Улаз: У првој линији стандардног улаза налази се број предмета n (1 ≤ n ≤ 50000). Свака од наредних
# n линија садржи по један природан број из интервала [1, 50000], ти бројеви представљају масе сваког од n
# предмета.
#
# Излаз: У првој линији стандарног излаза приказати тражену разлику маса.
#
# Пример
# Улаз
# 5
# 10
# 13
# 7
# 13
# 4
# Излаз
# -14

n = int(input("Unesi broj elemenata: "))

a=[int(input("Unesi masu predmeta: ")) for i in range(n)]

maksimum = max(a)
k= a.index(maksimum)
sum1=0
sum2=0

for i in range (0,k) :
    sum1=sum1+a[i]

for i in range (k+1,n):
    sum2=sum2+a[i]

print(sum1-sum2)
