# На аукцији неке слике учествује n купаца. Сваки купац је понудио извесни износ новца и сви купци су
# понудили различите износе. Написати програм којим се одређује редни број купца који је понудио највећи
# износ.
#
# Улаз: Прва линија стандарног улаза садржи природан број n (1 ≤ n ≤ 1000) који представља број купаца.
# У наредних n линија налази се по један позитиван реалан број, ти бројеви представљају износе новца коју
# су понудио купци редом.
#
# Излаз: У првој линији стандарног излаза приказати редни број купца који је понудио највећи износ новца.
#
# Пример
# Улаз
# 5
# 123.23
# 234.45
# 100.23
# 345.00
# 128.80
# Излаз
# 4

n = int(input("Unesi broj kupaca na aukciji: "))

a=[float(input("Unesi iznos novca koji je ponudi kupac: ")) for i in range(n)]

maksimum =a[0]
k=1

for i in range(1,n):
    if a[i]>maksimum:
        maksimum=a[i]
        k=i+1

print("Redni broj kupca koji je ponudio najveci iznos je: ",k)
